interface ResultText {
    ISTJ: string
    ESTJ: string
    ISTP: string
    ESTP: string
    ISFJ: string
    ESFJ: string
    ISFP: string
    ESFP: string
    INTJ: string
    ENTJ: string
    INTP: string
    ENTP: string
    INFJ: string
    ENFJ: string
    INFP: string
    ENFP: string
}

export const title: ResultText = {
    ISTJ: '시간의 방과 정장입은 소년',
    ESTJ: '체스보드와 저울을 든 관리자',
    ISTP: '앞치마를 두른 세공사',
    ESTP: '테니스 라켓을 든 항해사',
    ISFJ: '나무 뒤에 숨은 소년',
    ESFJ: '저울을 든 평화의 전달자',
    ISFP: '물병과 횃불: 두 얼굴의 소녀',
    ESFP: '화려한 테이블과 장신구를 두른 소녀',
    INTJ: '해와 달, 그리고 냉철한 연구자',
    ENTJ: '해와 달, 그리고 구름 위의 통솔자',
    INTP: '잠옷을 입고 사색하는 소년',
    ENTP: '토론하는 소년과 넘치는 화수분',
    INFJ: '꽃과 풀을 안은 소녀',
    ENFJ: '손 위의 식물을 직시하는 소녀',
    INFP: '중심의 세계와 균형의 소녀',
    ENFP: '조명 아래 화려한 미소의 소녀'
}

export const descriptionA: ResultText = {
    ISTJ: '다소내향적이지만 틀에 짜여진 사회에서 주어진 임무를 완수하기 위해 끊임없이 노력하는 당신과 잘 어울리는카드입니다. 주변에서는 당신을 융통성 없는 사람이라고 평가할 수도 있겠어요. 하지만 그만큼 자기주관이 뚜렷하고 책임감이 강한 당신은 계획적이고 논리적으로 세상을 바라보는 힘을 가졌네요. 일정과 계획을 꼼꼼하게 세우고 단정한 옷차림으로 주어진 업무를 수행해 나가는 마치 시간의 방에서 시계를 보고 있는 정장입은 소년처럼요.',
    ESTJ: '단정하면서도 카리스마 있는 당신은 현실적이고 책임감 있는 성격의 소유자입니다. 금빛 배경 앞에서 저울을 들고 무언가 말하는 듯한 카드 속 여성의 모습이, 질서 정연하고 카리스마 있는 당신의 모습과도 닮았네요. 정직하고 위풍당당한 당신은 마치 체스보드 위의 거침없고 계획적인 전략가와도 같아요. 게으름과는 거리가 먼 당신, 훌륭한 추진력으로 직업적 성취와 사회적 관계를 모두 놓치지 않기 위해 저울의 균형을 맞추며 살아가는 모습이 정말 멋지군요',
    ISTP: '호기심이 많고 독특한 감성을 지닌 당신에게 잘 어울리는 카드에요. 보석을 자세히 들여다보며, 다듬어지지 않은 원석을 세상에 없던 모습으로 만들어나가는 세공사처럼, 당신은 새로운 세상을 탐색하고 흥미로운 세계를 만들어 나가는 데에 관심이 많아요. 조용한 편이지만 새로운 일을 시도하는 것에 두려움이 없는 성격이네요. 카드 상단에 해와 달이 보이시나요? 게으를 땐 끝없이 게으르지만, 한번 시작한 일은 밤을 새서라도 끝까지 해내고 마는 당신의 모습과 세공사의 모습이 참 닮았어요.',
    ESTP: '특유의 센스와 유머러스함으로 모험을 즐기는 당신과 잘 어울리는 카드에요. 활동적이고 개방적인 당신은 예리한 관찰력의 소유자이기도 하네요. 말보다는 행동이 앞서는 당신은 폭풍 속 선박을 이끄는 항해사와도 같아요. 폭풍처럼 다가오는 눈 앞의 문제들을 현실적으로 해결해 나가는 당신은 타고난 리더형으로, 당신의 주변을 흥미로운 방향으로 이끌어가네요. 가끔은 규칙을 깨기도 하고, 계획에 없던 행동을 충동적으로 이행하기도 하지만, 당신의 행동력은 분명히 테니스 공을 올바른 방향으로 인도하게 될 거에요.',
    ISFJ: '조용하고 내성적인 듯 보이지만, 단단한 나무처럼 강단 있는 당신과 참 잘 어울리는 카드입니다. 여린 듯 보이지만 속은 단단한, 외유내강형의 전형이라고 말할 수 있겠어요. 소년이 입고 있는 녹색의 자켓처럼, 당신은 따뜻하고 편안한 사람이에요. 혼자 있는 시간을 중시하고, 주목 받는 것을 선호하지는 않지만, 섬세하고 배려심이 많은 당신의 주위에는 당신을 좋아하는 사람들로 가득하답니다.',
    ESFJ: '사교적이고 협동적인 당신과 잘 어울리는 카드입니다. 당신은 능동적이고 이타적인 성격으로, 타인과의 관계를 중시하는 성향이 있어요. 저울의 균형을 맞추듯, 균형과 조화를 중시하고 다른 사람들과의 소통을 중요하게 생각해요. 카드 상단에 있는 두 눈이 보이시나요? 다른 사람들의 시선을 신경 쓰고, 인정을 받는 것을 중시하는 당신을 직시하고 있는 것처럼 보이네요. 현실적이고 절차를 중시하며 안정을 추구하는 동시에 따뜻한 마음을 가진 당신은, 주위 사람들을 편안하고 행복하게 만들어주는 힘을 지녔어요.',
    ISFP: '몰입도가 뛰어난 예술가적 기질이 있는 동시에, 무대 위의 화려한 댄서처럼 내적 자유를 표출하고 싶어하는 당신과 닮은 카드입니다. 당신은 내적 가치관이나 목표, 신념을 최우선적 가치에 두고 살아갈 확률이 높아요. 타인의 감정에 민감하지만, 의외로 자기중심적인 면모도 있고요. 그래서 주변에서는 종종 당신을 ‘멀리서 볼 때와 가까이에서 볼 때 다르다’고 평가하겠네요. 현재의 즐거움을 추구하고 자유분방한 성격이지만, 자신의 일에 대한 책임감이 있고, 다른 사람들에게 민폐 끼치는 것을 극도로 기피해요. 그만큼 다른 사람들이 자신의 공간을 침범하는 것도 싫어하죠. 책임을 다하는 와중에도, 타인의 감정을 살피고 조화를 중시하는 당신의 모습. 정말 멋지네요.',
    ESFP: '사교적이고 활동적인 당신과 잘 어울리는 카드입니다. 즐거움을 추구하고 호불호가 분명한 당신은 조직생활보다는 자유로움을 추구하는 성향이 강해요. 카드 속 장신구를 두르고 화려한 커튼 아래 테이블에 앉아있는 소녀의 모습이 보이시나요? 다른 사람들의 인정을 받는 것을 중시하고, 외모에 관심이 많아 꾸미는 것을 좋아하는 당신과 많이 닮아 있네요. 끼도 많고 미적 감각도 뛰어난 당신은, 주위 사람들을 즐겁게 만들어주는 힘을 지녔어요.',
    INTJ: '합리적이고 효율성을 중시하며, 조금은 완벽주의적인 성향이 있는 당신과 잘 어울리는 카드입니다. 당신은 주위 사람들에게 감정적인 공감을 잘 해주지는 못하지만, 지인들이 말했던 사소한 것 하나까지도 잘 기억을 하는 편이네요. 오히려 그런 지점이 당신과 당신 주변의 사람들 사이의 관계를 더욱 공고히 하고 있는 걸지도 모르겠어요. 안정적인 삶을 지향할 것 같지만, 가끔은 모험적인 선택을 하기도 하는 당신은, 카드 속 냉철하지만 도전적인 표정을 짓고 있는 학자를 많이 닮았군요.',
    ENTJ: '이성적이고 통솔력이 뛰어난 당신과 잘 어울리는 카드에요. 장기적인 계획에 따라 움직이고, 삶을 주도적으로 이끌어 나가는 힘이 있는 당신과 카드 속의 여왕이 많이 닮아있네요. 당신의 논리적인 사고 방식과 열정적인 삶의 태도는 당신이 다른 사람들로부터 인정을 받는 데에 큰 역할을 합니다. 체계적이고 완벽을 추구하는 성향이 있는 당신은 현대 사회에서 가장 살아남기 좋은 유형이라는 평가를 받곤 하죠.',
    INTP: '논리적으로 사색하는 것을 즐기는 당신은 창의력과 창조력이 뛰어난 편입니다. 사회적 이슈에 관심을 갖고 주의를 기울이는 경우가 많고, 자신만의 철학에 따라 삶을 살아가곤 합니다. 사람들은 호기심이 많고 아이디어가 넘치는 당신에게서 많은 영감을 받기도 하죠. 왕좌에 앉아 사색하는 듯한 사진 속의 소년을 보세요. 자신만의 뚜렷한 가치관으로 세상을 바라보는 듯한 느낌이 들지 않나요?',
    ENTP: '다방면에 관심과 재능이 많고, 토론을 즐기는 당신과 잘 어울리는 카드입니다. 카드 속 소년이 입고 있는 셔츠에 입술 모양의 패턴이 보이시나요? 사회적 이슈와 다양한 대화의 주제들에 관심이 많은 당신의 성향을 나타내는듯 합니다. 소년 머리 위의 화수분처럼 물이 쏟아지는 금빛 잔은 당신의 쏟아지는 아이디어와 상상력을 닮았어요. 금빛 화수분처럼 독창적이고 창의력이 쏟아지는 당신은 주위에서 ‘다재다능’하다는 평을 많이 듣는 편이에요.',
    INFJ: '논리적으로 사색하는 것을 즐기는 당신은 창의력과 창조력이 뛰어난 편입니다. 사회적 이슈에 관심을 갖고 주의를 기울이는 경우가 많고, 자신만의 철학에 따라 삶을 살아가곤 합니다. 사람들은 호기심이 많고 아이디어가 넘치는 당신에게서 많은 영감을 받기도 하죠. 왕좌에 앉아 사색하는 듯한 사진 속의 소년을 보세요. 자신만의 뚜렷한 가치관으로 세상을 바라보는 듯한 느낌이 들지 않나요?',
    ENFJ: '다방면에 관심과 재능이 많고, 토론을 즐기는 당신과 잘 어울리는 카드입니다. 카드 속 소년이 입고 있는 셔츠에 입술 모양의 패턴이 보이시나요? 사회적 이슈와 다양한 대화의 주제들에 관심이 많은 당신의 성향을 나타내는듯 합니다. 소년 머리 위의 화수분처럼 물이 쏟아지는 금빛 잔은 당신의 쏟아지는 아이디어와 상상력을 닮았어요. 금빛 화수분처럼 독창적이고 창의력이 쏟아지는 당신은 주위에서 ‘다재다능’하다는 평을 많이 듣는 편이에요.',
    INFP: '사랑이 넘치고 섬세한 당신과 참 잘 어울리는 카드입니다. 당신은 서로 돕는 것과 평등, 균형있는 세상에 대한 열망이 강하네요. 내면에 존재하는 이상향과 도덕적 관념에서 영감을 받고, 확고한 신념과 열정으로 그 영감을 구현시켜 나가며 세상에 선한 영향력을 미치는 당신은 이 세상에 꼭 필요한 존재에요. 꾸준하고 지속력 있게, 계획한 일을 열정적으로 수행해 나가는 당신을 닮고 싶어 하는 사람들이 주위에 가득하겠네요.',
    ENFP: '책임감이 뛰어나고 열정적인 당신과 참 잘 어울리는 카드에요. 당신은 사람과 세상을 좋아하는 이타주의적 면모가 있지만, 자기 비판적인 측면이 있어서 스스로에 대해서는 엄격한 편이겠네요. 카드 속 소녀는 직선으로 자른 머리를 하고 화분만을 바라보고 있어요. 손 위의 화분은 무엇보다 소중하게 대하지만, 스스로에 대해서는 엄격한 잣대를 들기도 하는 당신과 많이 닮았군요. 그럼에도 말하거나 글쓰는 재능이 뛰어나고, 관심사가 다양하여 학습속도가 뛰어난 당신은 특유의 카리스마와 꼼꼼한 성격으로 주변의 사랑을 듬뿍 받겠군요.'
}

export const descriptionB: ResultText = {
    ISTJ: '합리적인 사고방식 덕분에, 패션에 있어서도 과시하려고 하기 보다는 가격을 우선적으로 검증해보는 편이에요. 다른 사람의 시선을 크게 신경 쓰는 편이 아니라, 과시하기 위해 가격대가 높은 잘 알려진 브랜드나 비싼 제품을 선택하는 경우는 드물어요. 정장입은 소년에게는 단지, TPO에 딱 맞는 단정한 옷이 필요할 뿐이거든요. 유행을 쫓아 옷을 구매하는 경우도 거의 없어요. 다만, 실용적이고 품질이 좋은 옷을 찾는 데에 신경을 쏟을 확률이 높아요. 오래 입을 수 있는 기본적인 디자인을 선호하고, 마감처리가 잘 되어 있는 옷을 좋아하네요. 자기 주관이 뚜렷한 성격 탓에, 무엇이 되었든 마음에 드는 스타일을 발견하면 그 스타일을 고수할지도 모르겠어요. 하지만 변화와 다른 가능성에 대해 개방적인 태도를 취하는 것도 가끔은 필요해요. 아래에 스타일 카드를 추천해줄게요. 나만의 새로운 스타일을 찾아보세요.',
    ESTJ: '패션에 있어서도 당신은 과시와 가격, 두 마리의 토끼를 모두 잡고 싶어해요. 외적인 모습을 신경 써 브랜드 의류를 소비하기도 하지만, 이에 앞서 꼼꼼한 비교를 통해 합리적인 가격의 옷을 선택하기도 하죠. 꼼꼼한 성격 탓에 유행을 쫓아 옷을 구매하는 경우도 거의 없어요. 하지만 유행에 따르는 것이 당신의 목표에 이르는 길에 필요하다면 말이 달라지겠네요. 다만, 실용적이고 품질이 좋은 옷을 찾는 데에 신경을 쏟을 확률이 높아요. 오래 입을 수 있는 기본적인 디자인에 마감처리가 잘 되어 있는 옷을 좋아하네요. 깔끔한 셔츠나 자켓으로 단정하고 포멀한 느낌을 주는 동시에 편안하고 클래식한 옷을 선호하겠어요. 자기 주관이 뚜렷한 성격을 가졌지만, 변화와 다른 가능성에 대해 개방적인 태도를 취하는 것도 가끔은 필요해요. 아래에 스타일 카드를 추천해줄게요. 나만의 새로운 스타일을 찾아보세요.',
    ISTP: '남들과 같은 옷은 싫지만 그렇다고 너무 비싼 옷도 싫어하는 당신. 노력 대비 효율이 가장 중요하지만, 옷을 구매할 때 그냥 대충 보고 고르지는 않아요. 남들의 시선을 신경 써서 굳이 무리한 소비를 하기 보다는, 합리적인 가격대의 스타일을 선택하는 편이에요. 당신에게는 유행을 따르는 것보다는 개성을 나타내는 것이 더 중요하네요. 특색 없고, 남들과 같은 옷을 싫어하는 당신은 편안하면서도 디테일이 살아있는 패션을 추구할 확률이 높아요. 편안한 옷에 액세서리나 향수로 포인트를 주는 방식을 선호할 것 같아요. 간단한 포인트를 주는 방식을 통해 신경써서 코디하지 않아도, 개성 있어 보이고 예쁜 옷을 추구하는 당신에게 잘 어울리는 스타일을 추천해드릴게요.',
    ESTP: '스타일을 특별하게 과시하지도, 그렇다고 싼 가격만 추구하지도 않아요. 어떤 옷을 사야겠다는 생각이 들었을 때 바로 실행에 옮기는 당신에게, 옷을 구매하는 이유와 가격은 크게 중요치 않아요. 난해하거나 개성 넘치는 옷보다는 분명한 목적과 쓰임을 지닌 옷을 좋아해요. 위 카드 속 여성이 운동을 위해 스포티한 반팔에 캡모자를 쓰고 있는 것처럼, 불편한 옷 보다는 활동에 적합한 옷을 선호하는 편이에요. 책상에서 하는 작업보다는 바깥 활동을 좋아하는 편이라 더욱 움직임에 지장이 있는 옷을 지양해요. 그러면서도 정보수집에 능숙한 덕분에 유행도 잘 알고 있고, 자유분방한 성향 덕분에 개성 넘치는 성격도 있는 편이에요. 그러나 경험한 것을 믿는 성격 탓에 유행이나 개성을 찾기 보다는 직접 입어보거나, 착용 리뷰를 살펴보고 상황에 맞는 실용적인 옷차림을 갖추는 것을 선호하는 편이에요.',
    ISFJ: '상대적으로 가격지향의 비율이 높지만, 가격이 옷을 고르는 데에 있어서 가장 우선적인 고려 요인은 아니에요. 다만, 돈이나 시간, 감정 등에 쓸데없는 낭비를 싫어하는 성향이 강한 당신은 높은 가격대의 옷으로 과시하려 하기 보다는 비교적 합리적인 가격의 제품을 선택할 확률이 높습니다. 당신은 나무 속의 소년처럼 정해진 틀을 깨는 것을 망설이고, 다수의 의견을 따르는 경우가 많아요. 그래서 자신만의 독특한 개성을 추구하기 보다는 유행을 신경 쓰는 편입니다. 하지만 외적 모습으로 주목받는 것을 좋아하지 않기 때문에, 맹목적으로 유행만을 따르지는 않아요. 파격적인 것 보다는 무난하고 베이직한 스타일을 선호하며, 꼼꼼한 성격으로 품질과 실용성 체크를 중요시합니다. 품질 좋은 무난한 옷을 오래 입는 것을 추구하기 때문에, 섬세한 비교를 통해 품질과 실용성, 디자인을 검증한 뒤에는 가격대가 높은 브랜드의 제품을 선택하기도 해요.',
    ESFJ: '당신은 돈보다는 지위나 명예를 중시하는 성향이 있어서, 패션에 있어서는 브랜드 밸류가 있는 옷을 선호할 가능성이 높습니다. 하지만, 일의 추진력이 부족한 편이고, 시작과 끝이 불분명한 탓에 최종적인 결정은 모호하게 내려지는 경우가 많아요. 이로 인해 당신의 패션에 일관성을 찾기는 어렵습니다. 원활한 관계 유지를 위한 유행 체크에 민감한 편이에요. 그래서 개성이 드러나는 독특한 디자인 보다는, 유행에 따르는 디테일을 지닌 디자인을 선택하는 경우가 많아요. 타인의 시선을 중시하는 탓에 가끔은 ‘있어 보이는’ 옷을 선택하곤 하는데, 이러한 선택에는 자연스레 품질 지향적 성향이 뒤따르게 됩니다. 자기주장이 강하지는 않지만, 한번 습관을 들이면 고치기 쉽지 않아 패션에서도 변화보다는 안정을 추구하는 성격이에요. 그러나, 집단의 목적을 개인의 이익보다 앞세우므로, 상황이나 요구에 따라 옷차림을 바꾸는 것을 크게 기피하지는 않습니다. 다만, 조화와 균형을 중시하기 때문에, 디자인적으로 조화롭지 않은 패션 조합을 기피하는 편이에요.',
    ISFP: '자유로운 영혼에 몰입력도 뛰어난 당신은, 현재의 삶과 만족도를 가장 중시하기 때문에 의류 구매시 가격을 최우선적으로 중시하지는 않아요. 더구나 순간의 즐거움에 취해 충동적인 소비를 할 확률이 높죠. 하지만 화합을 유지하는 것을 즐기고, 관대한 편이지만 자신의 신념을 지키는 것을 중요시 여기기 때문에, ‘과시’만을 위해 비싼 가격대의 제품을 고르는 경우는 거의 없답니다. 어느 하나 특별히 높거나 낮은 패션 성향은 없어요. 다만, 자연적이고 목가적인 색감이나 질감을 좋아할 확률이 높습니다. 예술적인 감각이 뛰어나기 때문에 개성을 중시할 가능성도 크지만, 이를 패션에 접목시킬 확률은 그 관심도에 따라 또 다시 50:50으로 나뉩니다. 평소에는 조용히 업무에 몰입하다가, 무대에 올라가면 끼를 발산하는 경우가 많아요. 그래서 평소 패션 스타일이 양 극단을 달릴 가능성이 매우 높습니다.',
    ESFP: '돈보다는 지위나 권위, 명예를 중시하는 성향이 있는 당신, 패션에 있어서는 저렴한 가격을 고려하기 보다는 외적으로 ‘있어 보이는’ 옷을 선호할 가능성이 높아요. 자신의 장점을 드러내는 것도 좋아하고, 충동적인 성격도 있어서 과시적인 패션 스타일과 소비 성향을 보이는 경우가 많습니다. 유행을 무시하지는 않지만, 자신만의 개성을 드러내는 옷을 특유의 미적 감각으로 선택하는 데에 능숙해요. 화려한 옷차림으로 기분전환을 하기도 하고, 다른 사람들과의 만남에 있어서도 옷차림이나 패션 센스를 갖추는 것이 중요한 덕목이라 생각하기도 해요. 외모에 관심이 많아서 꾸미는 것도 좋아하고, 사회성도 좋아 친구들과 놀러다니거나 여행을 갈 때 ‘드레스코드’를 신경쓰기도 합니다. 옷을 구매하는 과정에서 개인의 개성과 취향이 1순위로 작용하기 때문에, 품질/실용지향의 비중이 비교적 낮기는 하지만, 취향의 기준이 ‘품질 좋은 옷/브랜드’에 맞춰져 있다면, 그 누구보다 열심히 품질 좋은 옷을 찾아 헤매는 스타일이에요.',
    INTJ: '‘옷을 어떻게 코디해야 하는가’ 혹은 ‘다른 사람들이 이 옷을 입은 나를 어떻게 볼 것인가’에 신경을 쓰기 보다는, ‘어떤 옷을 입는가’가 더 중요해요. 다른 사람의 시선보다는 어떤 종류의, 얼마나 효율적인, 얼마나 편안한 옷을 입고 작업을 하는 지가 더 중요하기 때문이죠. 그래서인지 과시지향적인 소비는 거의 하지 않는 편이에요. 오히려, 꼼꼼하게 가격을 비교해보고 합리적인 선택을 하는 편이죠. 주로 무채색 옷이나, 베이지 계열의 옷과 같이 한 톤의 스타일만 주구장창 파는 타입일 확률이 높아요. 옷가게에 직접 가서 옷을 고르고, 점원과 대화를 나누는 감정적 소비도 싫어합니다. 그렇다고 온라인 쇼핑을 즐길 확률도 낮아요. 온라인 상에서 하나하나 꼼꼼하게 따져가며 옷을 고르는 것에도 피로감을 느끼기 때문이죠. 하지만 당신과 같은 유형의 사람들이, 패션에 관심을 가지기 시작하면 때로는 패션 스타일에 있어서 ‘완벽함’을 추구하기도 합니다. 카드 속 ‘해와 달’ 이 상징하는 ‘완벽함’ 처럼요. 작은 디테일을 신경써가며 옷을 고르기도 하고, 어떤 가치가 담긴 브랜드인지 꼼꼼히 알아보며 쇼핑을 하기도 하거든요. 하지만 대체로, 패션에 대한 감성이 조금은 부족한 당신에게 아래 스타일을 추천 해드릴게요.',
    ENTJ: '꼼꼼하고 체계적인 당신이지만, 패션과 소비에 있어서는 과시지향적인 면모도 있어요. 가격을 합리적으로 고려하려는 편이긴 하지만, 나의 위상을 결정하려는 남들의 시선을 어느정도는 신경 쓰기 때문이에요. 당신은 평소에 친구들 사이에서의 흐름을 주도적으로 이끌어 나갈 확률이 높지만, 패션에 있어서는 그렇지 않아요. 유행에 뒤쳐지지는 않지만 그렇다고 패션 유행을 주도적으로 이끌어가는 트렌드 세터의 역할을 할 확률은 낮습니다. 오히려, 실용적이고 품질 좋은 옷을 구매하는 것을 선호하는데, 이는 ‘오래 입을 수 있어서’ 등과 같은 이유의 측면 때문이라기보다는, 꼼꼼하고 정확한 성격과 체계적인 사고방식 때문에 결과적으로 나타나는 성향이에요. 성격이 겉으로 잘 드러나는 스타일이라서 패션에서도 본인의 개성이 드러나고는 하지만, 타인이 봤을 때 그 개성이 ‘독특하다’고 느껴질 정도는 아닌 경우가 많아요. 설명이 길었죠? 한마디로 요약하자면, 이 카드를 고른 당신은 ‘그냥 입고 싶은 대로 입는 편’ 입니다. 당신은 성취를 통해 행복을 느끼는 경우가 많네요. 아래 스타일을 추천해줄게요. 패션에서의 성취를 개성이 드러나는 옷을 통해 이뤄보는 것은 어떨까요?',
    INTP: '당신이 과시만을 위해 패션을 활용하는 경우는 거의 없습니다. 만일 패션에 관심이 있다면, 분석적으로 가격과 품질을 비교해서 옷을 구매하는 편입니다. 논리적이지 않다고 생각하는 것들을 무관심하게 여기는 경우가 많아요. 개인차가 있겠지만, 이 카드를 고른 사람들에게 ‘패션’은 주로 ‘논리적이지 않은 것’ 취급되곤 합니다. 하지만 창의력이 뛰어난 편이라, 독특한 상상력이 패션에 접목되면 개성이 뚜렷하게 드러나는 룩을 소화해내기도해요. 그러나 외적 행위보다는 지적인 성숙에 더욱 관심을 기울이고, 혼자만의 시간을 중시하기 때문에 패션센스를 드러내는 것에 큰 관심이 없는 편이에요. 사생활에 매우 민감한 당신은, 누군가가 본인을 단정짓는 것을 불쾌하게 여기곤 해서 ‘오늘 옷 잘어울린다’는 칭찬도 딱히 듣고 싶은 말은 아니에요. 그럼에도 불구하고 당신이 특별히 좋아하는 옷이 있다면 ‘의자에 앉았을 때 편안한 옷’이 아닐까요. 당신을 가로막는 단 한가지의 장애물은 실패에 대한 두려움이에요. 하지만, 패션은 실패해도 아무런 일도 일어나지 않는, 가장 도전해보기 좋은 분야 중 하나입니다. 아래에 카드를 추천해줄게요. 새로운 스타일에 도전해보는 것은 어떨까요?',
    ENTP: '하지만, 호불호가 심한 탓에 관심있는 것은 그 분야의 전문가가 될 만큼 깊게 파는 반면, 관심이 없는 주제들에는 전혀 주의를 기울이지 않습니다. 이러한 성향은 패션에도 반영되어, 패션 분야에 깊게 관심을 가지지 않는다면, ‘아무거나’ 입는 스타일을 고수할 가능성이 커요. 하지만 패션에 푹 빠지게 된다면, 실용성과 품질을 꼼꼼히 따져가며 패션을 소비할 확률이 높습니다. 혹시 ‘인싸 사이에서는 아싸, 아싸 사이에서는 인싸’로 불리지는 않나요? 당신은 타인과 어울리기를 좋아하지만, 협력하기를 좋아하는 것은 아닙니다. 남들의 사생활에도 별로 관심이 없어 그들이 어떤 옷을 입고, 무엇을 하며 사는 지는 별로 궁금해하지 않아요. 하지만 그들이 건네는 대화의 주제와 사회적 이슈들에는 흥미롭게 반응하는 편이에요. 개인의 영역을 중시하기 때문에 패션에 대해서도 참견하는 것을 별로 좋아하지 않습니다. 자신의 가치관을 우선시하기 때문에 유행을 따르기 보다는 보다는 개성지향적인 성향이 드러날 확률이 높습니다. 더불어 모험심이 강하기 때문에 위험을 감수해서라도 새로운 시도를 하기도 해요. 아래 스타일 카드를 추천해줄게요. 패션에서도 새로운 모험을 즐겨보는 것은 어떨까요?',
    INFJ: '당신이 과시만을 위해 패션을 활용하는 경우는 거의 없습니다. 만일 패션에 관심이 있다면, 분석적으로 가격과 품질을 비교해서 옷을 구매하는 편입니다. 논리적이지 않다고 생각하는 것들을 무관심하게 여기는 경우가 많아요. 개인차가 있겠지만, 이 카드를 고른 사람들에게 ‘패션’은 주로 ‘논리적이지 않은 것’ 취급되곤 합니다. 하지만 창의력이 뛰어난 편이라, 독특한 상상력이 패션에 접목되면 개성이 뚜렷하게 드러나는 룩을 소화해내기도해요. 그러나 외적 행위보다는 지적인 성숙에 더욱 관심을 기울이고, 혼자만의 시간을 중시하기 때문에 패션센스를 드러내는 것에 큰 관심이 없는 편이에요. 사생활에 매우 민감한 당신은, 누군가가 본인을 단정짓는 것을 불쾌하게 여기곤 해서 ‘오늘 옷 잘어울린다’는 칭찬도 딱히 듣고 싶은 말은 아니에요. 그럼에도 불구하고 당신이 특별히 좋아하는 옷이 있다면 ‘의자에 앉았을 때 편안한 옷’이 아닐까요. 당신을 가로막는 단 한가지의 장애물은 실패에 대한 두려움이에요. 하지만, 패션은 실패해도 아무런 일도 일어나지 않는, 가장 도전해보기 좋은 분야 중 하나입니다. 아래에 카드를 추천해줄게요. 새로운 스타일에 도전해보는 것은 어떨까요?',
    ENFJ: '하지만, 호불호가 심한 탓에 관심있는 것은 그 분야의 전문가가 될 만큼 깊게 파는 반면, 관심이 없는 주제들에는 전혀 주의를 기울이지 않습니다. 이러한 성향은 패션에도 반영되어, 패션 분야에 깊게 관심을 가지지 않는다면, ‘아무거나’ 입는 스타일을 고수할 가능성이 커요. 하지만 패션에 푹 빠지게 된다면, 실용성과 품질을 꼼꼼히 따져가며 패션을 소비할 확률이 높습니다. 혹시 ‘인싸 사이에서는 아싸, 아싸 사이에서는 인싸’로 불리지는 않나요? 당신은 타인과 어울리기를 좋아하지만, 협력하기를 좋아하는 것은 아닙니다. 남들의 사생활에도 별로 관심이 없어 그들이 어떤 옷을 입고, 무엇을 하며 사는 지는 별로 궁금해하지 않아요. 하지만 그들이 건네는 대화의 주제와 사회적 이슈들에는 흥미롭게 반응하는 편이에요. 개인의 영역을 중시하기 때문에 패션에 대해서도 참견하는 것을 별로 좋아하지 않습니다. 자신의 가치관을 우선시하기 때문에 유행을 따르기 보다는 보다는 개성지향적인 성향이 드러날 확률이 높습니다. 더불어 모험심이 강하기 때문에 위험을 감수해서라도 새로운 시도를 하기도 해요. 아래 스타일 카드를 추천해줄게요. 패션에서도 새로운 모험을 즐겨보는 것은 어떨까요?',
    INFP: '그러나 이상을 실현하기 위해 앞으로 나아가는 당신은 자신을 돌보지 못하는 경우가 많아요. 그 ‘스스로에 대한 무관심’이 패션에도 드러나는 경우가 종종 발견되곤 합니다. 목적을 달성하는 것, 때로는 세상에 미칠 선한 영향력이 되기도 하는 그 신념에 자신의 개성이나 패션 지향이 그리 중요치 않다고 여긴다면 스타일에 거의 신경을 쓰지 않는 경우가 많습니다. 하지만 제로웨이스트, 업사이클링 등 환경-윤리적 문제에 관심을 가질 확률이 높아서 이러한 성향이 패션 스타일에 나타나기도 해요. 다른 사람들도 이 사회적 문제에 함께 관심을 갖길 바라는 마음에 아주 조금은 의도적으로 과시적인 브랜드의 옷을 선택하기도 합니다. 하지만 당신에게 스타일에 있어서 무엇보다 중요한 가치는 실용성과 품질이겠네요. 당신은 섬세한 언어를 사용하여 대화를 나누는 편이에요. 그래서 가까운 친구나 동료들로부터 ‘사교적인 사람’이라는 오해를 사기도 하지만, 당신은 혼자만의 시간을 무엇보다 중시하는 편이네요. 그 시간을 방해하는 불편한 옷을 기피하기 때문에 실용성과 품질을 더욱 따지게 되겠고요. 아래에 당신을 위한 스타일을 추천해줄게요. 새로운 스타일에 도전해보며 좋은 영감을 받을 수 있을 거에요.',
    ENFP: '당신은 진실한 스타일을 좋아하겠어요. 그래서인지 사치스러운 소비는 기피하고, 가격과 과시력이 적당한 균형을 이루어 다른 사람들의 부정적인 평가에서 빗겨갈 수 있는 스타일을 추구하는 편입니다. 평소에는 리더의 역할을 자처하곤 하지만, 패션에 한에서는 트렌드 팔로워가 되겠군요. 조금 풀어서 설명하자면, 이 카드를 선택한 유형의 사람들은 타인을 지나치게 의식하는 면이 있기도 합니다. 특히, 자신이 했던 말에 대해 여러 번 곱씹어보고 후회하기도 하는 편입니다. 외적으로 모이는 모습에 있어서도 타인을 의식하는 편인데, 그래서 개성지향적인 면모보다는 유행에 따르는 패션성향이 두드러지게 나타나는 편이에에요. 그럼에도 불구하고, 품질 좋은 옷을 입길 원하는데, 당신이 생각하는 ‘품질 좋은 옷’이란, 사회적으로 무해하면서도 자신의 가치관을 드러낼 수 있는 옷이겠네요. 사진 속 소녀가 직시하고 있는 식물 처럼요. 아래에 당신을 위한 스타일을 추천해줄게요. 타인의 시선을 신경쓰지 말고, 새로운 스타일에 도전해보세요.\n'
}

export const style: ResultText = {
    ISTJ: '포멀',
    ESTJ: '세미포멀',
    ISTP: '’시크룩’에 포인트 악세사리',
    ESTP: '활동적인 ‘스포티룩’',
    ISFJ: '단정하고 무난한 ‘세미포멀’',
    ESFJ: '균형과 조화의 ‘톤온톤룩’',
    ISFP: '편안하고 자유로운 ‘아메카지룩’',
    ESFP: '자유로운 ‘파티룩’',
    INTJ: '무난하고 편안한 ‘유니섹스룩’',
    ENTJ: '인지도 높은 브랜드의 ‘세미포멀’',
    INTP: '앉아서도 편안한 ‘홈웨어’',
    ENTP: '인지도 높은 브랜드의 ‘세미포멀’',
    INFJ: '앉아서도 편안한 ‘홈웨어’',
    ENFJ: '독특한 철학이 담긴 브랜드의 ‘세미포멀’',
    INFP: '환경을 위한 ‘에코룩’',
    ENFP: '윤리경영 브랜드의, 유행에서 벗어나지 않는 ‘스트릿룩’'
}

export const recoStyle: ResultText = {
    ISTJ: '활동적인 ‘스포티룩’에 도전하는 것은 어떨까요?',
    ESTJ: '캐주얼룩’으로 몸과 마음을 편안히 가져보는 것은 어떨까요?',
    ISTP: '활동적인 ‘스포티룩’을 입고 밖으로 나가보는 것은 어떨까요?',
    ESTP: '가끔은 단정한 ‘포멀룩’에 도전해보는 것은 어떨까요?',
    ISFJ: '가끔은 도전적인 ‘히피룩’을 시도해보는 것은 어떨까요?',
    ESFJ: '다양한 대화를 위한 ‘유니섹스룩’은 어떨까요?',
    ISFP: '보다 더 활동적인 ‘스포티룩’은 어떨까요?',
    ESFP: '다양한 대화를 위한 ‘유니섹스룩’은 어떨까요?',
    INTJ: '고풍스러운 느낌에 개성있는 ‘빈티지룩’에 도전해보는 것은 어떨까요?',
    ENTJ: '색다른 ‘펑크룩’에 도전하며 패션에서의 성취를 이뤄보세요',
    INTP: '역동적인 ‘파티룩’에 도전해보는 것은 어떨까요?',
    ENTP: '색다른 ‘펑크룩’에 도전하며 패션에서의 성취를 이뤄보세요',
    INFJ: '역동적인 ‘파티룩’에 도전해보는 것은 어떨까요?',
    ENFJ: '자유로운 ‘히피룩’에 도전해보는 것은 어떨까요?',
    INFP: '자유로운 ‘히피룩’에서 새로운 영감을 받아보는 것은 어떨까요?',
    ENFP: '고풍스러운 느낌에 개성있는 ‘빈티지룩’에 도전해보는 것을 어떨까요?'
}


